[
  {
    "Type": "Finance",
    "NewsHeading": "IMF warns on $4.5 trillion bank exposure to hedge funds and private credit",
    "NewsDetail": "The IMF cautioned that U.S. and European banks face systemic risks due to massive $4.5 trillion exposure to hedge funds and private credit markets."
  },
  {
    "Type": "Finance",
    "NewsHeading": "Wall Street rises as investors digest Trump’s trade comments",
    "NewsDetail": "U.S. stocks rose as traders assessed Donald Trump’s latest remarks on China trade policy, easing fears of tariff escalations."
  },
  {
    "Type": "Finance",
    "NewsHeading": "Credit Suisse loses $440 million lawsuit against SoftBank",
    "NewsDetail": "Credit Suisse lost a major UK case seeking $440 million from SoftBank over losses tied to Greensill Capital’s collapse."
  },
  {
    "Type": "Finance",
    "NewsHeading": "Global oil prices surge amid Middle East tensions",
    "NewsDetail": "Crude prices jumped 3% as geopolitical tensions in the Middle East raised supply disruption concerns."
  },
  {
    "Type": "Finance",
    "NewsHeading": "AI drives record investment inflows into tech ETFs",
    "NewsDetail": "Investors poured billions into AI-focused exchange-traded funds, making them the fastest-growing segment in global finance."
  },
  {
    "Type": "Sports",
    "NewsHeading": "Buendía seals comeback win for Aston Villa against Tottenham",
    "NewsDetail": "Emiliano Buendía’s late strike helped Aston Villa defeat Tottenham Hotspur 2–1 in a thrilling Premier League match."
  },
  {
    "Type": "Sports",
    "NewsHeading": "India crushes Australia in T20 series finale",
    "NewsDetail": "India dominated the T20 series against Australia, winning by 8 wickets thanks to stellar performances by the top order."
  },
  {
    "Type": "Sports",
    "NewsHeading": "Matthew Stafford’s 5 TDs lead Rams past Jaguars in London",
    "NewsDetail": "Matthew Stafford threw five touchdowns as the Los Angeles Rams cruised to victory in the London NFL game."
  },
  {
    "Type": "Sports",
    "NewsHeading": "Ronny Deila dismissed as Atlanta United coach",
    "NewsDetail": "Ronny Deila was sacked after a disappointing season that saw only five wins in MLS competition."
  },
  {
    "Type": "Sports",
    "NewsHeading": "Novak Djokovic reaches Paris Masters final once again",
    "NewsDetail": "Djokovic advanced to his 10th Paris Masters final after defeating Carlos Alcaraz in straight sets."
  },
  {
    "Type": "Movies",
    "NewsHeading": "The Black Phone 2 tops box office with $26.5 million debut",
    "NewsDetail": "Horror sequel “The Black Phone 2” opened at No. 1 in North America, outperforming early expectations."
  },
  {
    "Type": "Movies",
    "NewsHeading": "Sydney Sweeney stuns at London premiere of boxing drama",
    "NewsDetail": "Actress Sydney Sweeney wowed the crowd in a pink lace dress at her new boxing film’s London premiere."
  },
  {
    "Type": "Movies",
    "NewsHeading": "‘Joker: Folie à Deux’ trailer breaks viewing records",
    "NewsDetail": "The upcoming “Joker” sequel starring Joaquin Phoenix and Lady Gaga became the most-watched movie trailer of 2025 so far."
  },
  {
    "Type": "Movies",
    "NewsHeading": "Marvel announces new Avengers lineup for 2026",
    "NewsDetail": "Marvel Studios confirmed the next Avengers team, including new characters and legacy heroes, at its annual event."
  },
  {
    "Type": "Movies",
    "NewsHeading": "Christopher Nolan’s next project to explore quantum computing",
    "NewsDetail": "Director Christopher Nolan revealed plans for his next movie, exploring ethics and power dynamics in the age of quantum AI."
  }
]
